martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    return err;
}

static void register_web_ui(void)
{
    const esp_console_cmd_t cmd = {
        .command = "web_ui",
        .help = "Manage the web interface\n"
                "  web_ui              - Show current status\n"
                "  web_ui enable       - Enable web interface (after reboot)\n"
                "  web_ui disable      - Disable web interface (after reboot)\n"
                "  web_ui port <port>  - Set web server port (after reboot)",
        .hint = " <enable|disable|port>",
        .func = &web_ui_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* --- Password hashing (SHA-256 + 16-byte salt) --- */
/* NVS key "web_password" stores "salt_hex:hash_hex" (32 + 1 + 64 = 97 chars) */

#define PW_SALT_LEN 16
#define PW_HASH_LEN 32   /* SHA-256 output */

static void pw_bytes_to_hex(const uint8_t *src, size_t len, char *out)
{
    for (size_t i = 0; i < len; i++) {
        sprintf(out + i * 2, "%02x", src[i]);
    }
    out[len * 2] = '\0';
}

static int pw_hex_to_bytes(const char *src, uint8_t *dst, size_t len)
{
    for (size_t i = 0; i < len; i++) {
        unsigned int b;
        if (sscanf(src + i * 2, "%2x", &b) != 1) return -1;
        dst[i] = (uint8_t)b;
    }
    return 0;
}

static void pw_compute_hash(const uint8_t *salt, size_t salt_len,
                            const char *plaintext, uint8_t *hash_out)
{
    mbedtls_sha256_context ctx;
    mbedtls_sha256_init(&ctx);
    mbedtls_sha256_starts(&ctx, 0);  /* 0 = SHA-256 (not 224) */
    mbedtls_sha256_update(&ctx, salt, salt_len);
    mbedtls_sha256_update(&ctx, (const uint8_t *)plaintext, strlen(plaintext));
    mbedtls_sha256_finish(&ctx, hash_out);
    mbedtls_sha256_free(&ctx);
}

bool is_web_password_set(void)
{
    nvs_handle_t nvs;
    if (nvs_open(PARAM_NAMESPACE, NVS_READONLY, &nvs) != ESP_OK) return false;

    size_t len = 0;
    esp_err_t err = nvs_get_str(nvs, "web_password", NULL, &len);
    nvs_close(nvs);
    return (err == ESP_OK && len > 1);  /* len includes null terminator */
}

bool verify_web_password(const char *plaintext)
{
    nvs_handle_t nvs;
    if (nvs_open(PARAM_NAMESPACE, NVS_READONLY, &nvs) != ESP_OK) return false;

    size_t stored_len = 0;
    esp_err_t err = nvs_get_str(nvs, "web_password", NULL, &stored_len);
    if (err != ESP_OK || stored_len <= 1) { nvs_close(nvs); return false; }

    char *stored = malloc(stored_len);
    if (!stored) { nvs_close(nvs); return false; }
    nvs_get_str(nvs, "web_password", stored, &stored_len);
    nvs_close(nvs);

    /* New format: "salt_hex:hash_hex" (32 + 1 + 64 = 97 chars + null) */
    char *colon = strchr(stored, ':');
    if (colon && (colon - stored) == PW_SALT_LEN * 2
              && strlen(colon + 1) == PW_HASH_LEN * 2) {
        /* Hashed format */
        uint8_t salt[PW_SALT_LEN], stored_hash[PW_HASH_LEN], computed_hash[PW_HASH_LEN];
        if (pw_hex_to_bytes(stored, salt, PW_SALT_LEN) != 0 ||
            pw_hex_to_bytes(colon + 1, stored_hash, PW_HASH_LEN) != 0) {
            free(stored);
            return false;
        }
        pw_compute_hash(salt, PW_SALT_LEN, plaintext, computed_hash);
        free(stored);

        /* Constant-time comparison */
        volatile int diff = 0;
        for (int i = 0; i < PW_HASH_LEN; i++) {
            diff |= stored_hash[i] ^ computed_hash[i];
        }
        return diff == 0;
    }

    /* Legacy plaintext format - compare directly, then migrate */
    bool match = (strcmp(stored, plaintext) == 0);
    free(stored);
    if (match) {
        /* Silently migrate to hashed format */
        set_web_password_hashed(plaintext);
    }
    return match;
}

esp_err_t set_web_password_hashed(const char *plaintext)
{
    if (plaintext[0] == '\0') {
        /* Empty = disable password */
        return set_config_param_str("web_password", "");
    }

    uint8_t salt[PW_SALT_LEN], hash[PW_HASH_LEN];
    esp_fill_random(salt, PW_SALT_LEN);
    pw_compute_hash(salt, PW_SALT_LEN, plaintext, hash);

    /* Format: "salt_hex:hash_hex" */
    char buf[PW_SALT_LEN * 2 + 1 + PW_HASH_LEN * 2 + 1];
    pw_bytes_to_hex(salt, PW_SALT_LEN, buf);
    buf[PW_SALT_LEN * 2] = ':';
    pw_bytes_to_hex(hash, PW_HASH_LEN, buf + PW_SALT_LEN * 2 + 1);

    return set_config_param_str("web_password", buf);
}

/* 'set_router_password' command */
static int set_router_password_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: set_router_password <password>\n");
        printf("Use empty string \"\" to disable password protection\n");
        return 1;
    }

    esp_err_t err = set_web_password_hashed(argv[1]);
    if (err == ESP_OK) {
        if (argv[1][0] == '\0') {
            ESP_LOGW(TAG, "Web password protection disabled via CLI.");
            printf("Password protection disabled.\n");
        } else {
            ESP_LOGW(TAG, "Web password changed via CLI.");
            printf("Password updated successfully.\n");
        }
    } else {
        printf("Failed to set password\n");
    }
    return err;
}

static void register_set_router_password(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_router_password",
        .help = "Set router password for web and remote console (empty string to disable)",
        .hint = NULL,
        .func = &set_router_password_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/** Arguments used by 'portmap' function */
static struct {
    struct arg_str *add_del;
    struct arg_str *TCP_UDP;
    struct arg_int *ext_port;
    struct arg_str *int_ip;
    struct arg_int *int_port;
    struct arg_str *iface;
    struct arg_end *end;
} portmap_args;

/* 'portmap' command */
int portmap(int argc, char **argv)
{
    int nerrors = arg_parse(argc, argv, (void **) &portmap_args);
    if (nerrors != 0) {
        arg_print_errors(stderr, portmap_args.end, argv[0]);
        return 1;
    }

    bool add;
    if (strcmp((char *)portmap_args.add_del->sval[0], "add")== 0) {
        add = true;
    } else if (strcmp((char *)portmap_args.add_del->sval[0], "del")== 0) {
        add = false;
    } else {
        printf("Must be 'add' or 'del'\n");
        return 1;
    }

    uint8_t tcp_udp;
    if (strcmp((char *)portmap_args.TCP_UDP->sval[0], "TCP")== 0) {
        tcp_udp = PROTO_TCP;
    } else if (strcmp((char *)portmap_args.TCP_UDP->sval[0], "UDP")== 0) {
        tcp_udp = PROTO_UDP;
    } else {
        printf("Must be 'TCP' or 'UDP'\n");
        return 1;
    }

