martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    if (dbm == 0) {
        printf("TX power set to max (default). Restart to apply.\n");
    } else {
        int8_t power_qdbm = (int8_t)(dbm * 4);
        ret = esp_wifi_set_max_tx_power(power_qdbm);
        if (ret == ESP_OK) {
            esp_wifi_get_max_tx_power(&current_power);
            printf("TX power set to %.1f dBm (applied immediately, saved for reboot).\n", current_power * 0.25);
        } else {
            printf("Saved for next reboot. Could not apply now: %s\n", esp_err_to_name(ret));
        }
    }
    return 0;
}

static void register_set_tx_power(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_tx_power",
        .help = "Set WiFi TX power in dBm (2-20, 0 = max/default)",
        .hint = NULL,
        .func = &set_tx_power_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

#if defined(CONFIG_IDF_TARGET_ESP32C6)
/* 'set_rf_switch_XIAO' command - XIAO ESP32-C6 antenna selection */
static int set_rf_switch_cmd(int argc, char **argv)
{
    if (argc < 2) {
        int current = 0;
        get_config_param_int("rf_switch", &current);
        printf("XIAO ESP32-C6 RF switch: %s\n", current ? "external antenna" : "built-in antenna (default)");
        printf("Usage: set_rf_switch_XIAO <0|1>\n");
        printf("  0 = built-in ceramic antenna (default)\n");
        printf("  1 = external antenna\n");
        return 0;
    }

    int value;
    if (strcmp(argv[1], "1") == 0) {
        value = 1;
    } else if (strcmp(argv[1], "0") == 0) {
        value = 0;
    } else {
        printf("Invalid value. Use 0 (built-in) or 1 (external).\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("rf_switch", value);
    if (err == ESP_OK) {
        // Apply immediately
        gpio_reset_pin(GPIO_NUM_3);
        gpio_set_direction(GPIO_NUM_3, GPIO_MODE_OUTPUT);
        gpio_set_level(GPIO_NUM_3, 0);  // Activate RF switch control
        vTaskDelay(pdMS_TO_TICKS(10));
        gpio_reset_pin(GPIO_NUM_14);
        gpio_set_direction(GPIO_NUM_14, GPIO_MODE_OUTPUT);
        gpio_set_level(GPIO_NUM_14, value); // 0 = built-in, 1 = external

        if (value) {
            printf("Switched to external antenna.\n");
        } else {
            printf("Switched to built-in ceramic antenna.\n");
        }
        printf("Setting saved (persists across reboots).\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_rf_switch(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_rf_switch_XIAO",
        .help = "XIAO ESP32-C6: switch between built-in (0) and external (1) antenna",
        .hint = NULL,
        .func = &set_rf_switch_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif

/* 'set_ap_hidden' command - hide or show AP SSID */
static int set_ap_hidden_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("AP SSID hidden: %s\n", ap_ssid_hidden ? "yes" : "no");
        return 0;
    }

    esp_err_t err;
    int hidden_val;

    // Parse argument
    if (parse_bool_true(argv[1])) {
        hidden_val = 1;
    } else if (parse_bool_false(argv[1])) {
        hidden_val = 0;
    } else {
        printf("Invalid value. Use true/false.\n");
        return 1;
    }

    err = set_config_param_int("ap_hidden", hidden_val);
    if (err == ESP_OK) {
        ap_ssid_hidden = (uint8_t)hidden_val;
        ESP_LOGI(TAG, "AP SSID hidden set to: %s", hidden_val ? "yes" : "no");
        printf("AP SSID hidden set to: %s\n", hidden_val ? "yes" : "no");
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_ap_hidden(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ap_hidden",
        .help = "Hide or show the AP SSID (on/off, requires restart)",
        .hint = NULL,
        .func = &set_ap_hidden_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'set_ap_auth' command - set AP authentication mode */
static int set_ap_auth_cmd(int argc, char **argv)
{
    const char *modes[] = {"wpa2wpa3", "wpa2", "wpa3"};

    if (argc < 2) {
        printf("AP auth mode: %s\n", modes[ap_authmode <= 2 ? ap_authmode : 0]);
        return 0;
    }

    int mode_val = -1;
    if (strcasecmp(argv[1], "wpa2wpa3") == 0 || strcasecmp(argv[1], "wpa2/wpa3") == 0) {
        mode_val = 0;
    } else if (strcasecmp(argv[1], "wpa2") == 0) {
        mode_val = 1;
    } else if (strcasecmp(argv[1], "wpa3") == 0) {
        mode_val = 2;
    } else {
        printf("Invalid mode. Use: wpa2, wpa3, or wpa2wpa3\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("ap_authmode", mode_val);
    if (err == ESP_OK) {
        ap_authmode = (uint8_t)mode_val;
        printf("AP auth mode set to: %s\n", modes[mode_val]);
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_ap_auth(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ap_auth",
        .help = "Set AP auth mode (wpa2, wpa3, or wpa2wpa3; requires restart)",
        .hint = NULL,
        .func = &set_ap_auth_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

#if CONFIG_ETH_UPLINK
/* 'set_ap_channel' command - set AP WiFi channel (ETH_UPLINK only) */
static int set_ap_channel_cmd(int argc, char **argv)
{
    if (argc < 2) {
        if (ap_channel == 0) {
            printf("AP channel: auto\n");
        } else {
            printf("AP channel: %d\n", ap_channel);
        }
        return 0;
    }

    int channel_val = atoi(argv[1]);
    if (channel_val < 0 || channel_val > 13) {
        printf("Invalid channel. Use 0 (auto) or 1-13.\n");
        return 1;
    }

    esp_err_t err = set_config_param_int("ap_channel", channel_val);
    if (err == ESP_OK) {
        ap_channel = (uint8_t)channel_val;
        if (channel_val == 0) {
            printf("AP channel set to: auto\n");
        } else {
            printf("AP channel set to: %d\n", channel_val);
        }
        printf("Restart the device for changes to take effect.\n");
    } else {
        printf("Failed to save setting\n");
    }
    return err;
}

static void register_set_ap_channel(void)
{
    const esp_console_cmd_t cmd = {
        .command = "set_ap_channel",
        .help = "Set AP WiFi channel (0=auto, 1-13=fixed, requires restart)",
        .hint = NULL,
        .func = &set_ap_channel_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}
#endif

/* 'ap' command - enable/disable AP interface dynamically */
static int ap_cmd(int argc, char **argv)
{
    if (argc < 2) {
        wifi_mode_t mode = WIFI_MODE_NULL;
        esp_wifi_get_mode(&mode);
#if CONFIG_ETH_UPLINK
        bool running = (mode == WIFI_MODE_AP);
#else
        bool running = (mode == WIFI_MODE_APSTA || mode == WIFI_MODE_AP);
#endif
        printf("AP interface: %s\n", running ? "enabled" : "disabled");
        printf("  (NVS setting: %s)\n", ap_disabled ? "disabled" : "enabled");
        printf("\nUsage:\n");
        printf("  ap enable   - Enable AP interface immediately\n");
        printf("  ap disable  - Disable AP interface immediately\n");
        return 0;
    }

    const char *action = argv[1];
    if (strcmp(action, "enable") == 0) {
        if (!ap_disabled) {
            printf("AP interface is already enabled.\n");
            return 0;
        }
        ap_set_enabled(true);
        printf("AP interface enabled.\n");
    } else if (strcmp(action, "disable") == 0) {
        if (ap_disabled) {
            printf("AP interface is already disabled.\n");
            return 0;
        }
        ap_set_enabled(false);
        printf("AP interface disabled.\n");
    } else {
        printf("Unknown action: %s\n", action);
        printf("Usage: ap <enable|disable>\n");
        return 1;
    }
    return 0;
}

