martin-ger/esp32_nat_router/components/cmd_router/cmd_router.c
    /* Parse list name */
    int list_no = acl_parse_name(argv[1]);
    if (list_no < 0) {
        printf("Invalid ACL list: %s\n", argv[1]);
        printf("Use: from_esp, to_esp, from_ap, to_ap\n");
        return 1;
    }

    if (argc < 3) {
        printf("Missing action. Use: clear, clear_stats, del, or <proto> <src> <dst> <action>\n");
        return 1;
    }

    /* Handle 'clear' action */
    if (strcmp(argv[2], "clear") == 0) {
        acl_clear(list_no);
        save_acl_rules();
        ESP_LOGW(TAG, "ACL list %s cleared via CLI.", acl_get_name(list_no));
        printf("ACL list %s cleared.\n", acl_get_name(list_no));
        return 0;
    }

    /* Handle 'clear_stats' action */
    if (strcmp(argv[2], "clear_stats") == 0) {
        acl_clear_stats(list_no);
        printf("ACL statistics for %s cleared.\n", acl_get_name(list_no));
        return 0;
    }

    /* Handle 'del' action */
    if (strcmp(argv[2], "del") == 0) {
        if (argc < 4) {
            printf("Usage: acl <list> del <index>\n");
            return 1;
        }
        int idx = atoi(argv[3]);
        if (idx < 0 || idx >= MAX_ACL_ENTRIES) {
            printf("Invalid rule index: %d (0-%d)\n", idx, MAX_ACL_ENTRIES - 1);
            return 1;
        }
        if (acl_delete(list_no, idx)) {
            save_acl_rules();
            ESP_LOGW(TAG, "ACL rule %d deleted from %s via CLI.", idx, acl_get_name(list_no));
            printf("Deleted rule %d from %s\n", idx, acl_get_name(list_no));
        } else {
            printf("No rule at index %d\n", idx);
        }
        return 0;
    }

    /* Parse as add rule: <proto> <src> [<s_port>] <dst> [<d_port>] <action> */
    const char *proto_str = argv[2];
    uint8_t proto;

    if (strcasecmp(proto_str, "IP") == 0) {
        proto = 0;
    } else if (strcasecmp(proto_str, "ICMP") == 0) {
        proto = 1;
    } else if (strcasecmp(proto_str, "TCP") == 0) {
        proto = 6;
    } else if (strcasecmp(proto_str, "UDP") == 0) {
        proto = 17;
    } else {
        printf("Invalid protocol: %s (use IP, ICMP, TCP, UDP)\n", proto_str);
        return 1;
    }

    /* For TCP/UDP, we expect: proto src s_port dst d_port action (7 args total)
       For IP/ICMP, we expect: proto src dst action (5 args total)
       But we also support: proto src dst action (no ports) for TCP/UDP */

    uint32_t src_ip, src_mask, dst_ip, dst_mask;
    uint16_t s_port = 0, d_port = 0;
    uint8_t allow;
    int arg_idx = 3;

    /* Parse source (IP/CIDR, 'any', or device name) */
    if (arg_idx >= argc) {
        printf("Missing source address\n");
        return 1;
    }
    if (!acl_parse_ip_or_name(argv[arg_idx], &src_ip, &src_mask)) {
        printf("Invalid source address or device name: %s\n", argv[arg_idx]);
        return 1;
    }
    arg_idx++;

    /* For TCP/UDP, check if next arg is a port */
    if ((proto == 6 || proto == 17) && arg_idx < argc) {
        if (strcmp(argv[arg_idx], "*") == 0 || strcmp(argv[arg_idx], "any") == 0) {
            s_port = 0;
            arg_idx++;
        } else if (argv[arg_idx][0] >= '0' && argv[arg_idx][0] <= '9') {
            s_port = atoi(argv[arg_idx]);
            arg_idx++;
        }
        /* If not a port-like value, treat as destination */
    }

    /* Parse destination (IP/CIDR, 'any', or device name) */
    if (arg_idx >= argc) {
        printf("Missing destination address\n");
        return 1;
    }
    if (!acl_parse_ip_or_name(argv[arg_idx], &dst_ip, &dst_mask)) {
        printf("Invalid destination address or device name: %s\n", argv[arg_idx]);
        return 1;
    }
    arg_idx++;

    /* For TCP/UDP, check if next arg is a port */
    if ((proto == 6 || proto == 17) && arg_idx < argc) {
        if (strcmp(argv[arg_idx], "*") == 0 || strcmp(argv[arg_idx], "any") == 0) {
            d_port = 0;
            arg_idx++;
        } else if (argv[arg_idx][0] >= '0' && argv[arg_idx][0] <= '9') {
            d_port = atoi(argv[arg_idx]);
            arg_idx++;
        }
        /* If not a port-like value, treat as action */
    }

    /* Parse action */
    if (arg_idx >= argc) {
        printf("Missing action (allow, deny, allow_monitor, deny_monitor)\n");
        return 1;
    }
    const char *action_str = argv[arg_idx];

    if (strcasecmp(action_str, "allow") == 0) {
        allow = ACL_ALLOW;
    } else if (strcasecmp(action_str, "deny") == 0) {
        allow = ACL_DENY;
    } else if (strcasecmp(action_str, "allow_monitor") == 0) {
        allow = ACL_ALLOW | ACL_MONITOR;
    } else if (strcasecmp(action_str, "deny_monitor") == 0) {
        allow = ACL_DENY | ACL_MONITOR;
    } else {
        printf("Invalid action: %s (use allow, deny, allow_monitor, deny_monitor)\n", action_str);
        return 1;
    }

    /* Add the rule */
    if (acl_add(list_no, src_ip, src_mask, dst_ip, dst_mask, proto, s_port, d_port, allow)) {
        save_acl_rules();
        ESP_LOGW(TAG, "ACL rule added to %s via CLI.", acl_get_name(list_no));
        printf("Rule added to %s\n", acl_get_name(list_no));
    } else {
        printf("Failed to add rule (list may be full)\n");
        return 1;
    }

    return 0;
}

static void register_acl(void)
{
    const esp_console_cmd_t cmd = {
        .command = "acl",
        .help = "Manage firewall ACL rules\n"
                "  acl <list> <proto> <src> [<s_port>] <dst> [<d_port>] <action>  - Add rule\n"
                "  acl <list> del <index>       - Delete rule at index\n"
                "  acl <list> clear             - Clear all rules from list\n"
                "  acl <list> clear_stats       - Clear statistics for list\n"
                "  Lists: to_esp, from_esp, to_ap, from_ap\n"
                "  Protocols: IP, TCP, UDP, ICMP\n"
                "  Actions: allow, deny, allow_monitor, deny_monitor",
        .hint = " <list> <proto> <src> [<s_port>] <dst> [<d_port>] <action>",
        .func = &acl_cmd,
    };
    ESP_ERROR_CHECK( esp_console_cmd_register(&cmd) );
}

/* 'remote_console' command implementation */
static int remote_console_cmd(int argc, char **argv)
{
    if (argc < 2) {
        printf("Usage: remote_console <action> [args]\n");
        printf("  status              - Show remote console status\n");
        printf("  enable              - Enable remote console\n");
        printf("  disable             - Disable remote console\n");
        printf("  port <port>         - Set TCP port (requires restart)\n");
        printf("  bind <both|ap|sta>  - Set interface binding\n");
        printf("  timeout <seconds>   - Set idle timeout (0=none)\n");
        printf("  kick                - Disconnect current session\n");
        return 0;
    }

    const char *action = argv[1];

